import React from 'react'

const Join02 = () => {
    return (
        <>
            <div id="join02__Wrap">
                <div className="join02__header">
                    <h1>회원가입</h1>
                    <p><span>이용약관</span>에 동의해주세요!</p>
                </div>
                <div className="join02__main">
                    <div className="join02__up">
                        <div>
                            <div></div>
                            <h2>이용약관 <span>(필수)</span></h2>
                        </div>
                        <p>
                            [ADD PLUS] 이용약관
                            1. 이용약관의 적용 및 효력일
                            1.1 본 이용약관은 ADD PLUS (이하 "회사")와 이를 이용하는 개인 및 법인 회원(이하 "이용자") 간의 서비스 이용과 관련한 권리, 의무, 책임사항, 기타 필요한 사항을 규정합니다.
                            1.2 본 약관은 이용자가 ADD PLUS 서비스에 가입함과 동시에 효력을 발생하며, 서비스 이용 중 이용약관이 변경될 경우 즉시 그 변경 사항이 적용됩니다.

                            2. 서비스 제공 및 이용
                            2.1 회사는 이용자에게 ADD PLUS 서비스를 제공합니다.
                            2.2 이용자는 본 서비스를 본 약관에서 정한 범위 내에서 이용할 수 있으며, 다른 목적으로 사용할 수 없습니다.

                            3. 개인정보 보호 및 안전성
                            3.1 회사는 이용자의 개인정보를 적절히 보호하며, 관련 법령에 따라 처리합니다.
                            3.2 이용자는 본인의 개인정보를 실시간으로 관리하며, 부정사용 방지를 위해 비밀번호 등을 안전하게 관리해야 합니다.

                            4. 서비스 이용의 제한
                            4.1 회사는 다음 각 호에 해당하는 경우 이용자의 서비스 이용을 제한할 수 있습니다.
                            4.1.1 본 약관 및 관련 법령의 위반 시
                            4.1.2 서비스의 안정적 운영을 방해하는 행위 시
                            4.1.3 기타 합리적인 사유가 있는 경우

                            5. 권리 및 책임
                            5.1 이용자는 회사가 제공하는 서비스를 이용함에 있어서 관련 법령, 본 약관에서 규정한 사항을 준수해야 합니다.
                            5.2 회사는 서비스 제공에 필요한 경우, 사전 고지 후 서비스 내용을 변경할 수 있습니다.

                            6. 계약해지
                            6.1 이용자는 언제든지 서비스 이용계약을 해지할 수 있습니다.
                            6.2 회사는 이용자가 본 약관을 위반하거나 서비스 운영을 고의로 방해한 경우 계약을 해지할 수 있습니다.

                            7. 면책 및 책임제한
                            7.1 회사는 천재지변, 기술적 결함, 서비스 이용자의 귀책사유로 인한 서비스 중단에 대해 책임을 지지 않습니다.
                            7.2 회사는 서비스 이용으로 발생한 직접적 또는 간접적인 손해에 대해 책임을 지지 않습니다.

                            8. 기타사항
                            8.1 본 약관에서 정하지 않은 사항은 관련 법령 및 회사의 정책에 따릅니다.
                            8.2 본 약관에 대한 해석 및 분쟁 해결은 대한민국 법을 적용하며, 관할 법원은 서울중앙지방법원으로 합니다.

                            9. 이용약관의 변경
                            9.1 회사는 필요한 경우 본 약관을 개정할 수 있습니다.
                            9.2 약관이 변경되는 경우, 변경 내용은 회사의 웹사이트나 애플리케이션을 통해 7일 이전에 공지됩니다.
                        </p>
                    </div>
                    <div className="join02__down">
                        <div>
                            <div></div>
                            <h2>개인정보 처리방침 <span>(필수)</span></h2>
                        </div>
                        <p>
                            [ADD PLUS] 이용약관

                            1. 이용약관의 적용 및 효력일

                            1.1 본 이용약관은 ADD PLUS (이하 "회사")와 이를 이용하는 개인 및 법인 회원(이하 "이용자") 간의 서비스 이용과 관련한 권리, 의무, 책임사항, 기타 필요한 사항을 규정합니다.

                            1.2 본 약관은 이용자가 ADD PLUS 서비스에 가입함과 동시에 효력을 발생하며, 서비스 이용 중 이용약관이 변경될 경우 즉시 그 변경 사항이 적용됩니다.

                            2. 서비스 제공 및 이용

                            2.1 회사는 이용자에게 ADD PLUS 서비스를 제공합니다.

                            2.2 이용자는 본 서비스를 본 약관에서 정한 범위 내에서 이용할 수 있으며, 다른 목적으로 사용할 수 없습니다.

                            3. 개인정보 보호 및 안전성

                            3.1 회사는 이용자의 개인정보를 적절히 보호하며, 관련 법령에 따라 처리합니다.

                            3.2 이용자는 본인의 개인정보를 실시간으로 관리하며, 부정사용 방지를 위해 비밀번호 등을 안전하게 관리해야 합니다.

                            4. 서비스 이용의 제한

                            4.1 회사는 다음 각 호에 해당하는 경우 이용자의 서비스 이용을 제한할 수 있습니다.

                            4.1.1 본 약관 및 관련 법령의 위반 시
                            4.1.2 서비스의 안정적 운영을 방해하는 행위 시
                            4.1.3 기타 합리적인 사유가 있는 경우

                            5. 권리 및 책임

                            5.1 이용자는 회사가 제공하는 서비스를 이용함에 있어서 관련 법령, 본 약관에서 규정한 사항을 준수해야 합니다.

                            5.2 회사는 서비스 제공에 필요한 경우, 사전 고지 후 서비스 내용을 변경할 수 있습니다.

                            6. 계약해지

                            6.1 이용자는 언제든지 서비스 이용계약을 해지할 수 있습니다.

                            6.2 회사는 이용자가 본 약관을 위반하거나 서비스 운영을 고의로 방해한 경우 계약을 해지할 수 있습니다.

                            7. 면책 및 책임제한

                            7.1 회사는 천재지변, 기술적 결함, 서비스 이용자의 귀책사유로 인한 서비스 중단에 대해 책임을 지지 않습니다.

                            7.2 회사는 서비스 이용으로 발생한 직접적 또는 간접적인 손해에 대해 책임을 지지 않습니다.

                            8. 기타사항

                            8.1 본 약관에서 정하지 않은 사항은 관련 법령 및 회사의 정책에 따릅니다.

                            8.2 본 약관에 대한 해석 및 분쟁 해결은 대한민국 법을 적용하며, 관할 법원은 서울중앙지방법원으로 합니다.

                            9. 이용약관의 변경

                            9.1 회사는 필요한 경우 본 약관을 개정할 수 있습니다.

                            9.2 약관이 변경되는 경우, 변경 내용은 회사의 웹사이트나 애플리케이션을 통해 7일 이전에 공지됩니다.
                        </p>
                    </div>
                    <div className="join_02_box">
                        <input type="checkbox" />
                        <p>모든 약관에 동의합니다</p>
                    </div>
                </div>
                <div className="join02_button_box">
                    <a href="./join03" className='join__button'>계속(2/3)</a>
                    <div>
                        <div className="join02__right">
                            <ul>
                                <li>이미 계정이 있으신가요? <a href="/login">로그인</a></li>
                            </ul>
                        </div>
                        <div className="join02__left">
                            <ul>
                                <li>
                                    <a href="/">아이디 찾기</a>
                                </li>
                            </ul>
                            <ul>
                                <li>
                                    <a href="/find">비밀번호 찾기</a>
                                </li>
                            </ul>
                        </div>
                    </div>
                </div>
            </div>
        </>
    )
}

export default Join02